{"config": [{"config": {"bias_regularizer": null, "activity_regularizer": null, "kernel_size": [9, 9], "kernel_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "data_format": "channels_last", "name": "con2d_layer1_with_elevation", "padding": "same", "batch_input_shape": [null, 128, 134, 2], "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.01, "seed": null}, "class_name": "RandomNormal"}, "dtype": "float32", "bias_constraint": null, "activation": "linear", "use_bias": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "trainable": true, "name": "batch_norm_layer1", "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "scale": true, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias_regularizer": null, "activity_regularizer": null, "kernel_size": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "data_format": "channels_last", "name": "conv2d_1", "padding": "same", "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.001, "seed": null}, "class_name": "RandomNormal"}, "bias_constraint": null, "activation": "linear", "use_bias": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "trainable": true, "name": "batch_normalization_1", "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "scale": true, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias_regularizer": null, "activity_regularizer": null, "kernel_size": [5, 5], "kernel_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "data_format": "channels_last", "name": "conv2d_2", "padding": "same", "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.001, "seed": null}, "class_name": "RandomNormal"}, "bias_constraint": null, "activation": "linear", "use_bias": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 1, "kernel_constraint": null}, "class_name": "Conv2D"}], "keras_version": "2.1.5", "class_name": "Sequential", "backend": "tensorflow"}